tap "derailed/k9s"
tap "fastly/tap"
tap "hhvm/hhvm"
tap "ngrok/ngrok"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "oven-sh/bun"
tap "qmk/qmk"
tap "railwayapp/tap"
brew "act"
brew "little-cms2"
brew "webp"
brew "automake"
brew "boost"
brew "avrdude"
brew "icu4c@76"
brew "sqlite"
brew "bfg"
brew "coreutils"
brew "tmux"
brew "byobu"
brew "carapace"
brew "ccache"
brew "cmake"
brew "ruby"
brew "cocoapods"
brew "colima", restart_service: :changed
brew "deno"
brew "diff-so-fancy"
brew "docker"
brew "docker-buildx"
brew "docker-compose"
brew "docker-credential-helper"
brew "node"
brew "pkgconf"
brew "emscripten"
brew "espeak-ng"
brew "opus"
brew "ffmpeg"
brew "libtool"
brew "fontforge"
brew "fzf"
brew "gcc"
brew "gh"
brew "ghcup"
brew "ghostscript"
brew "git"
brew "git-lfs"
brew "gnu-sed"
brew "go"
brew "hurl"
brew "imagemagick"
brew "jq"
brew "just"
brew "lazygit"
brew "lcov"
brew "libiconv"
brew "llvm@18"
brew "lnav"
brew "mise"
brew "mkcert"
brew "neovim"
brew "nginx", restart_service: :changed
brew "ninja"
brew "nnn"
brew "nss"
brew "nushell"
brew "ollama", restart_service: :changed
brew "opam"
brew "pillow"
brew "pipx"
brew "postgresql@18", restart_service: :changed
brew "protobuf"
brew "qemu"
brew "rust"
brew "spotify_player"
brew "stow"
brew "swiftlint"
brew "tcl-tk"
brew "tpm"
brew "tree"
brew "up"
brew "uv"
brew "valkey", restart_service: :changed
brew "wget"
brew "yt-dlp"
brew "z"
brew "zplug"
brew "derailed/k9s/k9s"
brew "fastly/tap/fastly", link: false
brew "oven-sh/bun/bun"
brew "qmk/qmk/qmk"
brew "railwayapp/tap/nixpacks"
cask "brave-browser"
cask "camo-studio"
cask "choosy"
cask "figma"
cask "firefox@developer-edition"
cask "font-monaspace"
cask "gcloud-cli"
cask "glyphs"
cask "iina"
cask "inkscape"
cask "istat-menus"
cask "keymapp"
cask "lm-studio"
cask "logi-options+"
cask "obs"
cask "openemu"
cask "raspberry-pi-imager"
cask "rocket"
cask "signal"
cask "steam"
cask "tailscale-app"
cask "the-battle-for-wesnoth"
cask "transmission"
cask "ungoogled-chromium"
cask "visual-studio-code"
cask "vscodium"
cask "wezterm"
cask "zen"
vscode "bierner.color-info"
vscode "bierner.markdown-preview-github-styles"
vscode "biomejs.biome"
vscode "bradlc.vscode-tailwindcss"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "ciantic.keymapceditor-vsc"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "frigus02.vscode-sql-tagged-template-literals-syntax-only"
vscode "github.vscode-github-actions"
vscode "haskell.haskell"
vscode "jacobpfeifer.pfeifer-hurl"
vscode "jeremybanka.aeos"
vscode "johnsoncodehk.vscode-tsconfig-helper"
vscode "justusadam.language-haskell"
vscode "kuscamara.remove-unused-imports"
vscode "miguelsolorio.fluent-icons"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode.live-server"
vscode "ms-vscode.vscode-typescript-next"
vscode "ms-vsliveshare.vsliveshare"
vscode "mxsdev.typescript-explorer"
vscode "oven.bun-vscode"
vscode "pkief.material-icon-theme"
vscode "qwtel.sqlite-viewer"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "rust-lang.rust-analyzer"
vscode "ryanluker.vscode-coverage-gutters"
vscode "sastan.twind-intellisense"
vscode "streetsidesoftware.code-spell-checker"
vscode "sumneko.lua"
vscode "supermaven.supermaven"
vscode "tamasfe.even-better-toml"
vscode "timonwong.shellcheck"
vscode "tyriar.sort-lines"
vscode "ue.alphabetical-sorter"
vscode "unifiedjs.vscode-mdx"
vscode "vscodevim.vim"
vscode "vunguyentuan.vscode-css-variables"
vscode "xiangdong-zeng.vscode-glyphs"
vscode "yoavbls.pretty-ts-errors"
vscode "yutengjing.open-in-external-app"
vscode "yzhang.markdown-all-in-one"
vscode "ziglang.vscode-zig"
