tap "qmk/qmk"
brew "carapace"
brew "little-cms2"
brew "sqlite"
brew "deno"
brew "diff-so-fancy"
brew "gh"
brew "git"
brew "helix"
brew "jj"
brew "lazygit"
brew "lima"
brew "llvm@18"
brew "mise"
brew "nushell"
brew "postgresql@18", restart_service: :changed
brew "qemu"
brew "stow"
brew "yt-dlp"
cask "blender"
cask "brave-browser"
cask "camo-studio"
cask "chatgpt"
cask "choosy"
cask "codex"
cask "codex-app"
cask "crossover"
cask "figma"
cask "firefox@developer-edition"
cask "glyphs"
cask "helium-browser"
cask "iina"
cask "istat-menus"
cask "keymapp"
cask "lm-studio"
cask "logi-options+"
cask "obs"
cask "openemu"
cask "raspberry-pi-imager"
cask "raycast"
cask "rocket"
cask "signal"
cask "steam"
cask "t3-code"
cask "tailscale-app"
cask "the-battle-for-wesnoth"
cask "transmission"
cask "ungoogled-chromium"
cask "utm"
cask "visual-studio-code"
cask "vscodium"
cask "wezterm"
cask "zen"
vscode "astro-build.astro-vscode"
vscode "bierner.color-info"
vscode "bierner.markdown-preview-github-styles"
vscode "biomejs.biome"
vscode "bradlc.vscode-tailwindcss"
vscode "charliermarsh.ruff"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "ciantic.keymapceditor-vsc"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "dprint.dprint"
vscode "esbenp.prettier-vscode"
vscode "foxundermoon.shell-format"
vscode "frigus02.vscode-sql-tagged-template-literals-syntax-only"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "haskell.haskell"
vscode "jacobpfeifer.pfeifer-hurl"
vscode "jeremybanka.aeos"
vscode "johnsoncodehk.vscode-tsconfig-helper"
vscode "justusadam.language-haskell"
vscode "kuscamara.remove-unused-imports"
vscode "llvm-vs-code-extensions.lldb-dap"
vscode "miguelsolorio.fluent-icons"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.vscode-typescript-next"
vscode "ms-vsliveshare.vsliveshare"
vscode "mxsdev.typescript-explorer"
vscode "nefrob.vscode-just-syntax"
vscode "oven.bun-vscode"
vscode "oxc.oxc-vscode"
vscode "pkief.material-icon-theme"
vscode "qwtel.sqlite-viewer"
vscode "redhat.vscode-yaml"
vscode "rust-lang.rust-analyzer"
vscode "ryanluker.vscode-coverage-gutters"
vscode "sastan.twind-intellisense"
vscode "streetsidesoftware.code-spell-checker"
vscode "sumneko.lua"
vscode "supermaven.supermaven"
vscode "swiftlang.swift-vscode"
vscode "tamasfe.even-better-toml"
vscode "thenuprojectcontributors.vscode-nushell-lang"
vscode "timonwong.shellcheck"
vscode "typescriptteam.native-preview"
vscode "tyriar.sort-lines"
vscode "ue.alphabetical-sorter"
vscode "unifiedjs.vscode-mdx"
vscode "vscodevim.vim"
vscode "vunguyentuan.vscode-css-variables"
vscode "xiangdong-zeng.vscode-glyphs"
vscode "yoavbls.pretty-ts-errors"
vscode "yutengjing.open-in-external-app"
