tap "derailed/k9s"
tap "fastly/tap"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/services"
tap "ngrok/ngrok"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "oven-sh/bun"
tap "qmk/qmk"
tap "railwayapp/tap"
brew "act"
brew "little-cms2"
brew "webp"
brew "automake"
brew "boost"
brew "avrdude"
brew "bfg"
brew "coreutils"
brew "tmux"
brew "byobu"
brew "ccache"
brew "cmake"
brew "colima", restart_service: true
brew "deno"
brew "diff-so-fancy"
brew "docker"
brew "docker-buildx"
brew "docker-compose"
brew "docker-credential-helper"
brew "node"
brew "pkgconf"
brew "emscripten"
brew "espeak-ng"
brew "opus"
brew "ffmpeg"
brew "fnm"
brew "libtool"
brew "fontforge"
brew "fzf"
brew "gcc"
brew "gh"
brew "ghcup"
brew "ghostscript"
brew "git"
brew "git-lfs"
brew "gnu-sed"
brew "go"
brew "hurl"
brew "imagemagick"
brew "jq"
brew "lazygit"
brew "lcov"
brew "libiconv"
brew "lnav"
brew "neovim"
brew "ninja"
brew "nnn"
brew "ollama", restart_service: true
brew "opam"
brew "tcl-tk"
brew "pillow"
brew "pipx"
brew "podman"
brew "postgresql@17", restart_service: true
brew "protobuf"
brew "ruby"
brew "rust"
brew "spotify_player"
brew "swiftlint"
brew "tpm"
brew "tree"
brew "up"
brew "valkey", restart_service: true
brew "wget"
brew "yt-dlp"
brew "z"
brew "zplug"
brew "derailed/k9s/k9s"
brew "fastly/tap/fastly", link: false
brew "oven-sh/bun/bun"
brew "qmk/qmk/qmk"
brew "railwayapp/tap/nixpacks"
cask "brave-browser"
cask "camo-studio"
cask "choosy"
cask "copilot-for-xcode"
cask "eloston-chromium"
cask "firefox"
cask "firefox@developer-edition"
cask "font-monaspace"
cask "github-copilot-for-xcode"
cask "glyphs"
cask "google-cloud-sdk"
cask "inkscape"
cask "istat-menus"
cask "keymapp"
cask "lm-studio"
cask "logi-options+"
cask "medis"
cask "miniforge"
cask "ngrok"
cask "obs"
cask "openemu"
cask "raspberry-pi-imager"
cask "rocket"
cask "spotify"
cask "tailscale"
cask "the-battle-for-wesnoth"
cask "transmission"
cask "vlc"
cask "vscodium"
cask "wezterm"
cask "whisky"
