tap "derailed/k9s"
tap "fastly/tap"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/services"
tap "ngrok/ngrok"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "qmk/qmk"
tap "railwayapp/tap"
brew "act"
brew "little-cms2"
brew "webp"
brew "automake"
brew "boost"
brew "avrdude"
brew "bfg"
brew "ccache"
brew "cmake"
brew "colima", restart_service: true
brew "coreutils"
brew "deno"
brew "diff-so-fancy"
brew "docker"
brew "docker-buildx"
brew "docker-compose"
brew "docker-credential-helper"
brew "node", link: false
brew "emscripten"
brew "ffmpeg"
brew "fnm"
brew "libtool"
brew "fontforge"
brew "fzf"
brew "gcc"
brew "gh"
brew "ghostscript"
brew "git"
brew "gnu-sed"
brew "go"
brew "hurl"
brew "imagemagick"
brew "jq"
brew "krb5"
brew "kubernetes-cli"
brew "lazygit"
brew "lcov"
brew "libiconv"
brew "llvm@15"
brew "neovim"
brew "ninja"
brew "nnn"
brew "tcl-tk"
brew "pillow"
brew "pipx"
brew "pkg-config"
brew "postgresql@16", restart_service: true
brew "protobuf"
brew "python@3.10"
brew "python@3.11"
brew "rust"
brew "spotify_player"
brew "swiftlint"
brew "tmux"
brew "tpm"
brew "tree"
brew "up"
brew "valkey", restart_service: true
brew "wget"
brew "yt-dlp"
brew "z"
brew "zplug"
brew "derailed/k9s/k9s"
brew "fastly/tap/fastly", link: false
brew "qmk/qmk/qmk"
brew "railwayapp/tap/nixpacks"
cask "brave-browser"
cask "copilot-for-xcode"
cask "eloston-chromium"
cask "fig"
cask "firefox"
cask "firefox@developer-edition"
cask "google-cloud-sdk"
cask "inkscape"
cask "medis"
cask "ngrok"
cask "the-battle-for-wesnoth"
cask "vscodium"
cask "wezterm"
vscode "abusaidm.html-snippets"
vscode "arcanis.vscode-zipfs"
vscode "artlaman.chalice-icon-theme"
vscode "astro-build.astro-vscode"
vscode "be5invis.vscode-icontheme-nomo-dark"
vscode "bierner.color-info"
vscode "bierner.comment-tagged-templates"
vscode "bierner.markdown-preview-github-styles"
vscode "biomejs.biome"
vscode "bradlc.vscode-tailwindcss"
vscode "chaliy.handlebars-preview"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "ciantic.keymapceditor-vsc"
vscode "coenraads.bracket-pair-colorizer-2"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "denoland.vscode-deno"
vscode "donjayamanne.jquerysnippets"
vscode "dtsvet.vscode-wasm"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "equinusocio.vsc-community-material-theme"
vscode "esbenp.prettier-vscode"
vscode "flowtype.flow-for-vscode"
vscode "frigus02.vscode-sql-tagged-template-literals-syntax-only"
vscode "github.codespaces"
vscode "github.copilot"
vscode "github.vscode-github-actions"
vscode "glenn2223.live-sass"
vscode "golang.go"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-execution"
vscode "graphql.vscode-graphql-syntax"
vscode "haskell.haskell"
vscode "helgardrichard.helium-icon-theme"
vscode "jacobpfeifer.pfeifer-hurl"
vscode "jeremybanka.aeos"
vscode "jeremybanka.aeos-black"
vscode "jeremybanka.blaze"
vscode "jeremybanka.nyth"
vscode "jeremybanka.selena"
vscode "jeremybanka.yolk"
vscode "johnsoncodehk.vscode-tsconfig-helper"
vscode "justusadam.language-haskell"
vscode "kuscamara.remove-unused-imports"
vscode "lokalise.i18n-ally"
vscode "mads-hartmann.bash-ide-vscode"
vscode "maxerbox.vscode-discord"
vscode "miguelsolorio.fluent-icons"
vscode "miguelsolorio.min-theme"
vscode "miguelsolorio.symbols"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.blazorwasm-companion"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.live-server"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.vscode-typescript-next"
vscode "ms-vsliveshare.vsliveshare"
vscode "mtxr.sqltools"
vscode "mxsdev.typescript-explorer"
vscode "ninoseki.vscode-mogami"
vscode "octref.vetur"
vscode "orta.vscode-jest"
vscode "oven.bun-vscode"
vscode "panicbit.cargo"
vscode "pkief.material-icon-theme"
vscode "pkief.material-product-icons"
vscode "prisma.prisma"
vscode "qwtel.sqlite-viewer"
vscode "rangav.vscode-thunder-client"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "rome.rome"
vscode "rust-lang.rust-analyzer"
vscode "ryanluker.vscode-coverage-gutters"
vscode "sastan.twind-intellisense"
vscode "scottsauber.blazorsnippets"
vscode "serayuzgur.crates"
vscode "skyran.js-jsx-snippets"
vscode "statelyai.stately-vscode"
vscode "streetsidesoftware.code-spell-checker"
vscode "styled-components.vscode-styled-components"
vscode "sumneko.lua"
vscode "supermaven.supermaven"
vscode "tamasfe.even-better-toml"
vscode "timonwong.shellcheck"
vscode "tloncorp.hoon-tloncorp"
vscode "tyriar.sort-lines"
vscode "ue.alphabetical-sorter"
vscode "unifiedjs.vscode-mdx"
vscode "vadimcn.vscode-lldb"
vscode "vitest.explorer"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "vunguyentuan.vscode-css-variables"
vscode "wallabyjs.console-ninja"
vscode "wallabyjs.dingo-vscode"
vscode "wallabyjs.quokka-vscode"
vscode "wallabyjs.wallaby-extension-pack"
vscode "wallabyjs.wallaby-vscode"
vscode "xabikos.javascriptsnippets"
vscode "xaver.clang-format"
vscode "xiangdong-zeng.vscode-glyphs"
vscode "yoavbls.pretty-ts-errors"
vscode "yutengjing.open-in-external-app"
vscode "yzhang.markdown-all-in-one"
vscode "ziglang.vscode-zig"
